TF_LOG=DEBUG terraform apply -auto-approve
```bash
2022-05-31T09:17:01.057Z [INFO]  Terraform version: 1.1.9
2022-05-31T09:17:01.057Z [INFO]  Go runtime version: go1.17.2
2022-05-31T09:17:01.057Z [INFO]  CLI args: []string{"terraform", "apply", "-auto-approve"}
2022-05-31T09:17:01.057Z [DEBUG] Attempting to open CLI config file: /home/tamojzes/.terraformrc
2022-05-31T09:17:01.057Z [DEBUG] File doesn't exist, but doesn't need to. Ignoring.
2022-05-31T09:17:01.057Z [INFO]  Loading CLI configuration from /home/tamojzes/.terraform.d/credentials.tfrc.json
2022-05-31T09:17:01.057Z [DEBUG] ignoring non-existing provider search directory terraform.d/plugins
2022-05-31T09:17:01.057Z [DEBUG] ignoring non-existing provider search directory /home/tamojzes/.terraform.d/plugins
2022-05-31T09:17:01.057Z [DEBUG] ignoring non-existing provider search directory /home/tamojzes/.local/share/terraform/plugins
2022-05-31T09:17:01.057Z [DEBUG] ignoring non-existing provider search directory /usr/local/share/terraform/plugins
2022-05-31T09:17:01.057Z [DEBUG] ignoring non-existing provider search directory /usr/share/terraform/plugins
2022-05-31T09:17:01.057Z [INFO]  CLI command args: []string{"apply", "-auto-approve"}
2022-05-31T09:17:01.058Z [DEBUG] New state was assigned lineage "d1e2ca76-7ef5-304e-09a9-44e8adfbfebd"
2022-05-31T09:17:01.142Z [DEBUG] checking for provisioner in "."
2022-05-31T09:17:01.144Z [DEBUG] checking for provisioner in "/usr/bin"
2022-05-31T09:17:01.144Z [INFO]  backend/local: starting Apply operation
2022-05-31T09:17:01.146Z [DEBUG] created provider logger: level=debug
2022-05-31T09:17:01.146Z [INFO]  provider: configuring client automatic mTLS
2022-05-31T09:17:01.156Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/opentelekomcloud/opentelekomcloud/1.29.4/linux_amd64/terraform-provider-opentelekomcloud_v1.29.4 args=[.terraform/providers/registry.terraform.io/opentelekomcloud/opentelekomcloud/1.29.4/linux_amd64/terraform-provider-opentelekomcloud_v1.29.4]
2022-05-31T09:17:01.156Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/opentelekomcloud/opentelekomcloud/1.29.4/linux_amd64/terraform-provider-opentelekomcloud_v1.29.4 pid=543395
2022-05-31T09:17:01.156Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/opentelekomcloud/opentelekomcloud/1.29.4/linux_amd64/terraform-provider-opentelekomcloud_v1.29.4
2022-05-31T09:17:01.164Z [INFO]  provider.terraform-provider-opentelekomcloud_v1.29.4: configuring server automatic mTLS: timestamp=2022-05-31T09:17:01.164Z
2022-05-31T09:17:01.189Z [DEBUG] provider.terraform-provider-opentelekomcloud_v1.29.4: plugin address: address=/tmp/plugin3749180197 network=unix timestamp=2022-05-31T09:17:01.189Z
2022-05-31T09:17:01.189Z [DEBUG] provider: using plugin: version=5
2022-05-31T09:17:01.230Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
2022-05-31T09:17:01.232Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/opentelekomcloud/opentelekomcloud/1.29.4/linux_amd64/terraform-provider-opentelekomcloud_v1.29.4 pid=543395
2022-05-31T09:17:01.232Z [DEBUG] provider: plugin exited
2022-05-31T09:17:01.232Z [DEBUG] Building and walking validate graph
2022-05-31T09:17:01.233Z [DEBUG] ProviderTransformer: "module.microos.opentelekomcloud_images_image_v2.OpenSUSE_MicroOS_Tumbleweed" (*terraform.NodeValidatableResource) needs provider["registry.terraform.io/opentelekomcloud/opentelekomcloud"]
2022-05-31T09:17:01.233Z [DEBUG] ReferenceTransformer: "var.image_name" references: []
2022-05-31T09:17:01.233Z [DEBUG] ReferenceTransformer: "var.local_file_path" references: []
2022-05-31T09:17:01.233Z [DEBUG] ReferenceTransformer: "var.otc_user_name" references: []
2022-05-31T09:17:01.233Z [DEBUG] ReferenceTransformer: "module.microos.var.disk_format (expand)" references: [var.disk_format]
2022-05-31T09:17:01.233Z [DEBUG] ReferenceTransformer: "module.microos.var.image_name (expand)" references: [var.image_name]
2022-05-31T09:17:01.233Z [DEBUG] ReferenceTransformer: "module.microos (close)" references: []
2022-05-31T09:17:01.233Z [DEBUG] ReferenceTransformer: "var.disk_format" references: []
2022-05-31T09:17:01.233Z [DEBUG] ReferenceTransformer: "var.otc_password" references: []
2022-05-31T09:17:01.233Z [DEBUG] ReferenceTransformer: "var.otc_tenant_name" references: []
2022-05-31T09:17:01.233Z [DEBUG] ReferenceTransformer: "var.otc_domain_name" references: []
2022-05-31T09:17:01.233Z [DEBUG] ReferenceTransformer: "module.microos.var.container_format (expand)" references: [var.container_format]
2022-05-31T09:17:01.233Z [DEBUG] ReferenceTransformer: "module.microos.opentelekomcloud_images_image_v2.OpenSUSE_MicroOS_Tumbleweed" references: [module.microos.var.local_file_path (expand) module.microos.var.container_format (expand) module.microos.var.image_name (expand) module.microos.var.disk_format (expand)]
2022-05-31T09:17:01.233Z [DEBUG] ReferenceTransformer: "var.container_format" references: []
2022-05-31T09:17:01.233Z [DEBUG] ReferenceTransformer: "provider[\"registry.terraform.io/opentelekomcloud/opentelekomcloud\"]" references: [var.otc_password var.otc_domain_name var.otc_tenant_name var.otc_user_name]
2022-05-31T09:17:01.233Z [DEBUG] ReferenceTransformer: "module.microos.var.local_file_path (expand)" references: [var.local_file_path]
2022-05-31T09:17:01.233Z [DEBUG] ReferenceTransformer: "module.microos (expand)" references: []
2022-05-31T09:17:01.234Z [DEBUG] Starting graph walk: walkValidate
2022-05-31T09:17:01.234Z [DEBUG] created provider logger: level=debug
2022-05-31T09:17:01.234Z [INFO]  provider: configuring client automatic mTLS
2022-05-31T09:17:01.246Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/opentelekomcloud/opentelekomcloud/1.29.4/linux_amd64/terraform-provider-opentelekomcloud_v1.29.4 args=[.terraform/providers/registry.terraform.io/opentelekomcloud/opentelekomcloud/1.29.4/linux_amd64/terraform-provider-opentelekomcloud_v1.29.4]
2022-05-31T09:17:01.246Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/opentelekomcloud/opentelekomcloud/1.29.4/linux_amd64/terraform-provider-opentelekomcloud_v1.29.4 pid=543405
2022-05-31T09:17:01.246Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/opentelekomcloud/opentelekomcloud/1.29.4/linux_amd64/terraform-provider-opentelekomcloud_v1.29.4
2022-05-31T09:17:01.255Z [INFO]  provider.terraform-provider-opentelekomcloud_v1.29.4: configuring server automatic mTLS: timestamp=2022-05-31T09:17:01.255Z
2022-05-31T09:17:01.276Z [DEBUG] provider: using plugin: version=5
2022-05-31T09:17:01.276Z [DEBUG] provider.terraform-provider-opentelekomcloud_v1.29.4: plugin address: address=/tmp/plugin500765301 network=unix timestamp=2022-05-31T09:17:01.276Z
2022-05-31T09:17:01.339Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
2022-05-31T09:17:01.341Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/opentelekomcloud/opentelekomcloud/1.29.4/linux_amd64/terraform-provider-opentelekomcloud_v1.29.4 pid=543405
2022-05-31T09:17:01.341Z [DEBUG] provider: plugin exited
2022-05-31T09:17:01.341Z [INFO]  backend/local: apply calling Plan
2022-05-31T09:17:01.341Z [DEBUG] Building and walking plan graph for NormalMode
2022-05-31T09:17:01.342Z [DEBUG] ProviderTransformer: "module.microos.opentelekomcloud_images_image_v2.OpenSUSE_MicroOS_Tumbleweed (expand)" (*terraform.nodeExpandPlannableResource) needs provider["registry.terraform.io/opentelekomcloud/opentelekomcloud"]
2022-05-31T09:17:01.342Z [DEBUG] ReferenceTransformer: "var.image_name" references: []
2022-05-31T09:17:01.342Z [DEBUG] ReferenceTransformer: "module.microos (expand)" references: []
2022-05-31T09:17:01.342Z [DEBUG] ReferenceTransformer: "var.local_file_path" references: []
2022-05-31T09:17:01.342Z [DEBUG] ReferenceTransformer: "var.otc_domain_name" references: []
2022-05-31T09:17:01.342Z [DEBUG] ReferenceTransformer: "module.microos.var.local_file_path (expand)" references: [var.local_file_path]
2022-05-31T09:17:01.342Z [DEBUG] ReferenceTransformer: "module.microos.var.disk_format (expand)" references: [var.disk_format]
2022-05-31T09:17:01.342Z [DEBUG] ReferenceTransformer: "var.disk_format" references: []
2022-05-31T09:17:01.342Z [DEBUG] ReferenceTransformer: "var.otc_password" references: []
2022-05-31T09:17:01.342Z [DEBUG] ReferenceTransformer: "var.otc_tenant_name" references: []
2022-05-31T09:17:01.342Z [DEBUG] ReferenceTransformer: "var.container_format" references: []
2022-05-31T09:17:01.342Z [DEBUG] ReferenceTransformer: "var.otc_user_name" references: []
2022-05-31T09:17:01.342Z [DEBUG] ReferenceTransformer: "module.microos.var.image_name (expand)" references: [var.image_name]
2022-05-31T09:17:01.342Z [DEBUG] ReferenceTransformer: "module.microos.var.container_format (expand)" references: [var.container_format]
2022-05-31T09:17:01.342Z [DEBUG] ReferenceTransformer: "provider[\"registry.terraform.io/opentelekomcloud/opentelekomcloud\"]" references: [var.otc_domain_name var.otc_tenant_name var.otc_user_name var.otc_password]
2022-05-31T09:17:01.342Z [DEBUG] ReferenceTransformer: "module.microos (close)" references: []
2022-05-31T09:17:01.342Z [DEBUG] ReferenceTransformer: "module.microos.opentelekomcloud_images_image_v2.OpenSUSE_MicroOS_Tumbleweed (expand)" references: [module.microos.var.local_file_path (expand) module.microos.var.disk_format (expand) module.microos.var.container_format (expand) module.microos.var.image_name (expand)]
2022-05-31T09:17:01.343Z [DEBUG] Starting graph walk: walkPlan
2022-05-31T09:17:01.344Z [DEBUG] created provider logger: level=debug
2022-05-31T09:17:01.344Z [INFO]  provider: configuring client automatic mTLS
2022-05-31T09:17:01.353Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/opentelekomcloud/opentelekomcloud/1.29.4/linux_amd64/terraform-provider-opentelekomcloud_v1.29.4 args=[.terraform/providers/registry.terraform.io/opentelekomcloud/opentelekomcloud/1.29.4/linux_amd64/terraform-provider-opentelekomcloud_v1.29.4]
2022-05-31T09:17:01.353Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/opentelekomcloud/opentelekomcloud/1.29.4/linux_amd64/terraform-provider-opentelekomcloud_v1.29.4 pid=543414
2022-05-31T09:17:01.353Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/opentelekomcloud/opentelekomcloud/1.29.4/linux_amd64/terraform-provider-opentelekomcloud_v1.29.4
2022-05-31T09:17:01.362Z [INFO]  provider.terraform-provider-opentelekomcloud_v1.29.4: configuring server automatic mTLS: timestamp=2022-05-31T09:17:01.362Z
2022-05-31T09:17:01.382Z [DEBUG] provider: using plugin: version=5
2022-05-31T09:17:01.382Z [DEBUG] provider.terraform-provider-opentelekomcloud_v1.29.4: plugin address: address=/tmp/plugin3278348355 network=unix timestamp=2022-05-31T09:17:01.382Z
2022-05-31T09:17:01.439Z [WARN]  ValidateProviderConfig from "provider[\"registry.terraform.io/opentelekomcloud/opentelekomcloud\"]" changed the config value, but that value is unused
2022-05-31T09:17:01.581Z [DEBUG] Resource instance state not found for node "module.microos.opentelekomcloud_images_image_v2.OpenSUSE_MicroOS_Tumbleweed", instance module.microos.opentelekomcloud_images_image_v2.OpenSUSE_MicroOS_Tumbleweed
2022-05-31T09:17:01.581Z [INFO]  ReferenceTransformer: reference not found: "var.container_format"
2022-05-31T09:17:01.581Z [INFO]  ReferenceTransformer: reference not found: "var.image_name"
2022-05-31T09:17:01.581Z [INFO]  ReferenceTransformer: reference not found: "var.local_file_path"
2022-05-31T09:17:01.581Z [INFO]  ReferenceTransformer: reference not found: "var.disk_format"
2022-05-31T09:17:01.581Z [DEBUG] ReferenceTransformer: "module.microos.opentelekomcloud_images_image_v2.OpenSUSE_MicroOS_Tumbleweed" references: []
2022-05-31T09:17:01.581Z [DEBUG] refresh: module.microos.opentelekomcloud_images_image_v2.OpenSUSE_MicroOS_Tumbleweed: no state, so not refreshing
2022-05-31T09:17:01.583Z [WARN]  Provider "registry.terraform.io/opentelekomcloud/opentelekomcloud" produced an invalid plan for module.microos.opentelekomcloud_images_image_v2.OpenSUSE_MicroOS_Tumbleweed, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .disk_format: planned value cty.StringVal("") does not match config value cty.StringVal("qcow2")
      - .image_cache_path: planned value cty.StringVal("/home/tamojzes/.terraform/image_cache") for a non-computed attribute
      - .visibility: planned value cty.StringVal("private") for a non-computed attribute
      - .protected: planned value cty.False for a non-computed attribute
      - .min_ram_mb: planned value cty.NumberIntVal(0) for a non-computed attribute
2022-05-31T09:17:01.584Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
2022-05-31T09:17:01.585Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/opentelekomcloud/opentelekomcloud/1.29.4/linux_amd64/terraform-provider-opentelekomcloud_v1.29.4 pid=543414
2022-05-31T09:17:01.585Z [DEBUG] provider: plugin exited

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.microos.opentelekomcloud_images_image_v2.OpenSUSE_MicroOS_Tumbleweed will be created
  + resource "opentelekomcloud_images_image_v2" "OpenSUSE_MicroOS_Tumbleweed" {
      + checksum         = (known after apply)
      + container_format = "bare"
      + created_at       = (known after apply)
      + file             = (known after apply)
      + id               = (known after apply)
      + image_cache_path = "/home/tamojzes/.terraform/image_cache"
      + local_file_path  = "/home/tamojzes/Projects/rke2/images/openSUSE-MicroOS.x86_64-ContainerHost-OpenStack-Cloud.qcow2"
      + metadata         = (known after apply)
      + min_ram_mb       = 0
      + name             = "OpenSUSE_MicroOS_Tumbleweed"
      + owner            = (known after apply)
      + protected        = false
      + region           = (known after apply)
      + schema           = (known after apply)
      + size_bytes       = (known after apply)
      + status           = (known after apply)
      + update_at        = (known after apply)
      + visibility       = "private"
    }

Plan: 1 to add, 0 to change, 0 to destroy.
2022-05-31T09:17:01.586Z [INFO]  backend/local: apply calling Apply
2022-05-31T09:17:01.586Z [DEBUG] Building and walking apply graph for NormalMode plan
2022-05-31T09:17:01.586Z [DEBUG] Resource state not found for node "module.microos.opentelekomcloud_images_image_v2.OpenSUSE_MicroOS_Tumbleweed", instance module.microos.opentelekomcloud_images_image_v2.OpenSUSE_MicroOS_Tumbleweed
2022-05-31T09:17:01.587Z [DEBUG] ProviderTransformer: "module.microos.opentelekomcloud_images_image_v2.OpenSUSE_MicroOS_Tumbleweed" (*terraform.NodeApplyableResourceInstance) needs provider["registry.terraform.io/opentelekomcloud/opentelekomcloud"]
2022-05-31T09:17:01.587Z [DEBUG] ProviderTransformer: "module.microos.opentelekomcloud_images_image_v2.OpenSUSE_MicroOS_Tumbleweed (expand)" (*terraform.nodeExpandApplyableResource) needs provider["registry.terraform.io/opentelekomcloud/opentelekomcloud"]
2022-05-31T09:17:01.587Z [DEBUG] ReferenceTransformer: "module.microos.var.local_file_path (expand)" references: [var.local_file_path]
2022-05-31T09:17:01.587Z [DEBUG] ReferenceTransformer: "module.microos (close)" references: []
2022-05-31T09:17:01.587Z [DEBUG] ReferenceTransformer: "var.otc_password" references: []
2022-05-31T09:17:01.587Z [DEBUG] ReferenceTransformer: "var.disk_format" references: []
2022-05-31T09:17:01.587Z [DEBUG] ReferenceTransformer: "var.otc_user_name" references: []
2022-05-31T09:17:01.587Z [DEBUG] ReferenceTransformer: "module.microos.opentelekomcloud_images_image_v2.OpenSUSE_MicroOS_Tumbleweed" references: [module.microos.var.local_file_path (expand) module.microos.var.disk_format (expand) module.microos.var.container_format (expand) module.microos.var.image_name (expand)]
2022-05-31T09:17:01.587Z [DEBUG] ReferenceTransformer: "var.image_name" references: []
2022-05-31T09:17:01.587Z [DEBUG] ReferenceTransformer: "var.container_format" references: []
2022-05-31T09:17:01.587Z [DEBUG] ReferenceTransformer: "module.microos.var.disk_format (expand)" references: [var.disk_format]
2022-05-31T09:17:01.587Z [DEBUG] ReferenceTransformer: "module.microos.var.container_format (expand)" references: [var.container_format]
2022-05-31T09:17:01.587Z [DEBUG] ReferenceTransformer: "provider[\"registry.terraform.io/opentelekomcloud/opentelekomcloud\"]" references: [var.otc_password var.otc_domain_name var.otc_tenant_name var.otc_user_name]
2022-05-31T09:17:01.587Z [DEBUG] ReferenceTransformer: "module.microos (expand)" references: []
2022-05-31T09:17:01.587Z [DEBUG] ReferenceTransformer: "var.otc_tenant_name" references: []
2022-05-31T09:17:01.587Z [DEBUG] ReferenceTransformer: "var.local_file_path" references: []
2022-05-31T09:17:01.587Z [DEBUG] ReferenceTransformer: "module.microos.var.image_name (expand)" references: [var.image_name]
2022-05-31T09:17:01.587Z [DEBUG] ReferenceTransformer: "module.microos.opentelekomcloud_images_image_v2.OpenSUSE_MicroOS_Tumbleweed (expand)" references: []
2022-05-31T09:17:01.587Z [DEBUG] ReferenceTransformer: "var.otc_domain_name" references: []
2022-05-31T09:17:01.588Z [DEBUG] Starting graph walk: walkApply
2022-05-31T09:17:01.588Z [DEBUG] created provider logger: level=debug
2022-05-31T09:17:01.588Z [INFO]  provider: configuring client automatic mTLS
2022-05-31T09:17:01.598Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/opentelekomcloud/opentelekomcloud/1.29.4/linux_amd64/terraform-provider-opentelekomcloud_v1.29.4 args=[.terraform/providers/registry.terraform.io/opentelekomcloud/opentelekomcloud/1.29.4/linux_amd64/terraform-provider-opentelekomcloud_v1.29.4]
2022-05-31T09:17:01.599Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/opentelekomcloud/opentelekomcloud/1.29.4/linux_amd64/terraform-provider-opentelekomcloud_v1.29.4 pid=543423
2022-05-31T09:17:01.599Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/opentelekomcloud/opentelekomcloud/1.29.4/linux_amd64/terraform-provider-opentelekomcloud_v1.29.4
2022-05-31T09:17:01.607Z [INFO]  provider.terraform-provider-opentelekomcloud_v1.29.4: configuring server automatic mTLS: timestamp=2022-05-31T09:17:01.607Z
2022-05-31T09:17:01.630Z [DEBUG] provider.terraform-provider-opentelekomcloud_v1.29.4: plugin address: network=unix address=/tmp/plugin272659816 timestamp=2022-05-31T09:17:01.630Z
2022-05-31T09:17:01.630Z [DEBUG] provider: using plugin: version=5
2022-05-31T09:17:01.685Z [WARN]  ValidateProviderConfig from "provider[\"registry.terraform.io/opentelekomcloud/opentelekomcloud\"]" changed the config value, but that value is unused
2022-05-31T09:17:01.831Z [WARN]  Provider "registry.terraform.io/opentelekomcloud/opentelekomcloud" produced an invalid plan for module.microos.opentelekomcloud_images_image_v2.OpenSUSE_MicroOS_Tumbleweed, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .min_ram_mb: planned value cty.NumberIntVal(0) for a non-computed attribute
      - .disk_format: planned value cty.StringVal("") does not match config value cty.StringVal("qcow2")
      - .image_cache_path: planned value cty.StringVal("/home/tamojzes/.terraform/image_cache") for a non-computed attribute
      - .visibility: planned value cty.StringVal("private") for a non-computed attribute
      - .protected: planned value cty.False for a non-computed attribute
module.microos.opentelekomcloud_images_image_v2.OpenSUSE_MicroOS_Tumbleweed: Creating...
2022-05-31T09:17:01.831Z [INFO]  Starting apply for module.microos.opentelekomcloud_images_image_v2.OpenSUSE_MicroOS_Tumbleweed
2022-05-31T09:17:01.831Z [DEBUG] module.microos.opentelekomcloud_images_image_v2.OpenSUSE_MicroOS_Tumbleweed: applying the planned Create change
2022-05-31T09:17:01.832Z [INFO]  provider.terraform-provider-opentelekomcloud_v1.29.4: 2022/05/31 09:17:01 [DEBUG] setting computed for "metadata" from ComputedKeys: timestamp=2022-05-31T09:17:01.832Z
2022-05-31T09:17:01.832Z [INFO]  provider.terraform-provider-opentelekomcloud_v1.29.4: 2022/05/31 09:17:01 [DEBUG] Create Options: &images.CreateOpts{Name:"OpenSUSE_MicroOS_Tumbleweed", ID:"", Visibility:(*images.ImageVisibility)(0xc00083f280), Tags:[]string(nil), ContainerFormat:"bare", DiskFormat:"", MinDisk:0, MinRAM:0, Protected:(*bool)(0xc000acf380), Properties:map[string]string(nil)}: timestamp=2022-05-31T09:17:01.832Z
2022-05-31T09:17:03.343Z [INFO]  provider.terraform-provider-opentelekomcloud_v1.29.4: 2022/05/31 09:17:03 [WARN] Uploading image a6abfd4f-73e9-48ac-9ab0-337df1718c34 (460849152 bytes). This can be pretty long.: timestamp=2022-05-31T09:17:03.343Z
module.microos.opentelekomcloud_images_image_v2.OpenSUSE_MicroOS_Tumbleweed: Still creating... [10s elapsed]
module.microos.opentelekomcloud_images_image_v2.OpenSUSE_MicroOS_Tumbleweed: Still creating... [20s elapsed]
module.microos.opentelekomcloud_images_image_v2.OpenSUSE_MicroOS_Tumbleweed: Still creating... [30s elapsed]
module.microos.opentelekomcloud_images_image_v2.OpenSUSE_MicroOS_Tumbleweed: Still creating... [40s elapsed]
module.microos.opentelekomcloud_images_image_v2.OpenSUSE_MicroOS_Tumbleweed: Still creating... [50s elapsed]
module.microos.opentelekomcloud_images_image_v2.OpenSUSE_MicroOS_Tumbleweed: Still creating... [1m0s elapsed]
module.microos.opentelekomcloud_images_image_v2.OpenSUSE_MicroOS_Tumbleweed: Still creating... [1m10s elapsed]
module.microos.opentelekomcloud_images_image_v2.OpenSUSE_MicroOS_Tumbleweed: Still creating... [1m20s elapsed]
2022-05-31T09:18:31.274Z [ERROR] vertex "module.microos.opentelekomcloud_images_image_v2.OpenSUSE_MicroOS_Tumbleweed" error: error while uploading file "/home/tamojzes/Projects/rke2/images/openSUSE-MicroOS.x86_64-ContainerHost-OpenStack-Cloud.qcow2": Put "https://ims.eu-de.otc.t-systems.com/v2/images/a6abfd4f-73e9-48ac-9ab0-337df1718c34/file": OpenTelecomCloud connection error, retries exhausted. Aborting. Last error was: read /home/tamojzes/Projects/rke2/images/openSUSE-MicroOS.x86_64-ContainerHost-OpenStack-Cloud.qcow2: file already closed
╷
│ Error: error while uploading file "/home/tamojzes/Projects/rke2/images/openSUSE-MicroOS.x86_64-ContainerHost-OpenStack-Cloud.qcow2": Put "https://ims.eu-de.otc.t-systems.com/v2/images/a6abfd4f-73e9-48ac-9ab0-337df1718c34/file": OpenTelecomCloud connection error, retries exhausted. Aborting. Last error was: read /home/tamojzes/Projects/rke2/images/openSUSE-MicroOS.x86_64-ContainerHost-OpenStack-Cloud.qcow2: file already closed
│ 
│   with module.microos.opentelekomcloud_images_image_v2.OpenSUSE_MicroOS_Tumbleweed,
│   on modules/otc-base-os/main.tf line 1, in resource "opentelekomcloud_images_image_v2" "OpenSUSE_MicroOS_Tumbleweed":
│    1: resource "opentelekomcloud_images_image_v2" "OpenSUSE_MicroOS_Tumbleweed" {
│ 
╵
2022-05-31T09:18:31.277Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
2022-05-31T09:18:31.278Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/opentelekomcloud/opentelekomcloud/1.29.4/linux_amd64/terraform-provider-opentelekomcloud_v1.29.4 pid=543423
2022-05-31T09:18:31.278Z [DEBUG] provider: plugin exited
```